In [19]:
import pandas as pd
df = pd.read_csv("test.csv")

In [11]:
#iterate way 1
#for row in df.itertuples():
    #print(row)
    #print("\n\n")

In [13]:
#iterate way 2
#for index, row in df.iterrows():
 #   print(index)
 #   print(row)

In [15]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [22]:
# create a new column with an existing column
# end of file
df["new_column"] = df["Name"].apply(lambda x :  x + "!")

In [23]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_column
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,"Kelly, Mr. James!"
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,"Wilkes, Mrs. James (Ellen Needs)!"
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,"Myles, Mr. Thomas Francis!"
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,"Wirz, Mr. Albert!"
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)!"

In [26]:
# group one column by the vaule of another column
df.groupby("Sex").Name.sum().reset_index()

      Sex                                               Name
0  female  Wilkes, Mrs. James (Ellen Needs)Hirvonen, Mrs....
1    male  Kelly, Mr. JamesMyles, Mr. Thomas FrancisWirz,...

In [42]:
#pd.concat([df["Name"], df["Sex"]], axis = 1)

In [54]:
df1 = pd.DataFrame({"x": [1,2],"y":[3,4]})
df2 = pd.DataFrame({"a": [5,6],"b":[7,8]})
df1

   x  y
0  1  3
1  2  4

In [55]:
df2

   a  b
0  5  7
1  6  8

In [56]:
# concat also checks the clumn name
pd.concat([df1,df2], axis = 0)

     a    b    x    y
0  NaN  NaN  1.0  3.0
1  NaN  NaN  2.0  4.0
0  5.0  7.0  NaN  NaN
1  6.0  8.0  NaN  NaN

In [57]:
pd.concat([df1,df2], axis = 1)

   x  y  a  b
0  1  3  5  7
1  2  4  6  8

In [61]:
# rename the column
df2 = df2.rename(index = str, columns = {"a": "x", "b": "y"} )
# have to make df2 =  to make the df2 really change

In [62]:
df2

   x  y
0  5  7
1  6  8

In [63]:
pd.concat([df1, df2], axis = 0)

   x  y
0  1  3
1  2  4
0  5  7
1  6  8

In [65]:
df1

   x  y
0  1  3
1  2  4

In [66]:
df2

   x  y
0  5  7
1  6  8

In [69]:
pd.concat([df1, df2], axis = "columns")  
# no merge just physically concat

     x    y    x    y
0  1.0  3.0  NaN  NaN
1  2.0  4.0  NaN  NaN
0  NaN  NaN  5.0  7.0
1  NaN  NaN  6.0  8.0

In [78]:
pd.merge(df1, df2)

Empty DataFrame
Columns: [x, y]
Index: []

In [80]:
df1

   x  y
0  1  3
1  2  4

In [82]:
import numpy as np

In [84]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_column
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,"Kelly, Mr. James!"
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,"Wilkes, Mrs. James (Ellen Needs)!"
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,"Myles, Mr. Thomas Francis!"
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,"Wirz, Mr. Albert!"
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)!"

In [86]:

# alter the extre values to <= mean + (75% -  50%) * 3
df["Age"].describe()

count    332.000000
mean      30.272590
std       14.181209
min        0.170000
25%       21.000000
50%       27.000000
75%       39.000000
max       76.000000
Name: Age, dtype: float64

In [88]:
des = df["Age"].describe()
valid_max = des["50%"] + 3 * ( des["75%"] - des["50%"] )
valid_max

63.0

In [89]:
df["Age"] = df["Age"].clip(0, valid_max)

In [90]:
df["Age"].describe()

count    332.000000
mean      30.212349
std       14.020703
min        0.170000
25%       21.000000
50%       27.000000
75%       39.000000
max       63.000000
Name: Age, dtype: float64

In [92]:
# use mean/std to handle extreme valuese
m = df["Age"].mean()
m

30.212349397590362

In [94]:
s = df["Age"].std()
s

14.020702751356762

In [98]:
valid_max = m + 3 * s
valid_min = m - 3 * s
valid_max

72.27445765166064

In [99]:
valid_min

-11.84975885647992

In [100]:
df["Age"] = df["Age"].clip(valid_min, valid_max)

In [101]:
df["Age"].describe()

count    332.000000
mean      30.212349
std       14.020703
min        0.170000
25%       21.000000
50%       27.000000
75%       39.000000
max       63.000000
Name: Age, dtype: float64

In [102]:
pd.get_dummies()

TypeError: get_dummies() missing 1 required positional argument: 'data'

In [111]:
df = pd.read_csv("ad_feature.csv")
df["price"].describe()

count    8.468110e+05
mean     1.838867e+03
std      3.108877e+05
min      1.000000e-02
25%      4.900000e+01
50%      1.390000e+02
75%      3.520000e+02
max      1.000000e+08
Name: price, dtype: float64

In [116]:
df['column_bin'] = pd.qcut( df['price'] , np.linspace( 0 , 1, 11  ) ,duplicates='drop') 
df["column_bin"]

0                        (139.0, 198.0]
1                        (198.0, 288.0]
2                         (17.37, 38.0]
3                         (98.0, 139.0]
4                         (17.37, 38.0]
5                        (198.0, 288.0]
6                         (98.0, 139.0]
7                         (17.37, 38.0]
8                         (17.37, 38.0]
9                        (288.0, 439.0]
10                       (288.0, 439.0]
11                       (439.0, 970.0]
12                       (288.0, 439.0]
13                       (198.0, 288.0]
14                       (198.0, 288.0]
15                       (198.0, 288.0]
16                         (63.8, 98.0]
17                       (198.0, 288.0]
18                       (198.0, 288.0]
19                        (98.0, 139.0]
20                         (63.8, 98.0]
21                       (198.0, 288.0]
22                       (198.0, 288.0]
23                       (198.0, 288.0]
24                       (198.0, 288.0]
25                         (38.0, 63.8]
26                         (38.0, 63.8]
27                         (63.8, 98.0]
28        (0.009000000000000001, 17.37]
29        (0.009000000000000001, 17.37]
                      ...
846781                   (288.0, 439.0]
846782                   (288.0, 439.0]
846783                   (198.0, 288.0]
846784                   (198.0, 288.0]
846785                   (198.0, 288.0]
846786                   (288.0, 439.0]
846787                   (288.0, 439.0]
846788                   (288.0, 439.0]
846789                   (288.0, 439.0]
846790                   (288.0, 439.0]
846791                   (439.0, 970.0]
846792                   (198.0, 288.0]
846793                   (198.0, 288.0]
846794                   (198.0, 288.0]
846795                   (198.0, 288.0]
846796              (970.0, 99999999.0]
846797                    (17.37, 38.0]
846798                    (98.0, 139.0]
846799                    (98.0, 139.0]
846800                   (198.0, 288.0]
846801                     (63.8, 98.0]
846802                   (288.0, 439.0]
846803                   (198.0, 288.0]
846804                    (98.0, 139.0]
846805                   (139.0, 198.0]
846806                   (198.0, 288.0]
846807                     (63.8, 98.0]
846808                     (63.8, 98.0]
846809                     (63.8, 98.0]
846810                   (198.0, 288.0]
Name: column_bin, Length: 846811, dtype: category
Categories (10, interval[float64]): [(0.009000000000000001, 17.37] < (17.37, 38.0] < (38.0, 63.8] < (63.8, 98.0] ... (198.0, 288.0] < (288.0, 439.0] < (439.0, 970.0] < (970.0, 99999999.0]]

In [119]:
df['price']

0          170.00
1          199.00
2           38.00
3          139.00
4           32.99
5          199.00
6           99.00
7           33.00
8           19.00
9          428.00
10         368.00
11         639.00
12         368.00
13         249.00
14         249.00
15         249.00
16          89.90
17         249.00
18         249.00
19          99.00
20          69.90
21         249.00
22         249.00
23         249.00
24         239.00
25          59.00
26          39.90
27          75.00
28           1.88
29          10.00
           ...
846781     355.00
846782     328.00
846783     285.00
846784     270.00
846785     270.00
846786     370.00
846787     312.00
846788     341.00
846789     370.00
846790     383.00
846791     456.00
846792     228.00
846793     270.00
846794     256.00
846795     285.00
846796    1288.00
846797      28.00
846798     119.00
846799     119.00
846800     210.00
846801      75.00
846802     376.00
846803     260.00
846804     128.00
846805     169.00
846806     268.00
846807      68.00
846808      88.00
846809      68.00
846810     279.00
Name: price, Length: 846811, dtype: float64

In [121]:
df.head()

,adgroup_id,cate_id,campaign_id,customer,brand,price,column_bin
0,63133,6406,83237,1,95471.0,170.00,"(139.0, 198.0]"
1,313401,6406,83237,1,87331.0,199.00,"(198.0, 288.0]"
2,248909,392,83237,1,32233.0,38.00,"(17.37, 38.0]"
3,208458,392,83237,1,174374.0,139.00,"(98.0, 139.0]"
4,110847,7211,135256,2,145952.0,32.99,"(17.37, 38.0]"

In [118]:
df['column_bin_fac'] = pd.factorize( df['column_bin'], sort=True)

ValueError: Length of values does not match length of index